# 1) შექმენი სია, სადაც შეინახავ შენს საყვარელ ფერებს.

fav_colors = ["yellow" , "blue" , "green"]

# 2) შექმენი სია, სადაც შეინახავ კვირის დღეებს.

week_days = ["monday" , "tuesday" , "wednesday" , "thursday" , "friday" , "Saturday" , "sunday"]

# 3) შექმენი სია, სადაც შეინახავ 5 სხვადასხვა რიცხვს. -> დაბეჭდე მესამე ინდექსზე მყოფი ელემენტი

numbers = [1 , 2 , 3 , 4 , 5]
print(numbers[3])

# 4) შექმენი სია, სადაც შეინახავ 5 ქალაქის სახელს. -> შეცვალე მეორე ინდექსზე მყოფი ელემენტი სხვა ქალაქით

cities = ["tbilisi" , "paris" , "moscow" , "newyork" , "rome"]
cities [2] = "washington DC"
print (cities[2])
# 5) შექმენი სია, სადაც შეინახავ შენი ოჯახის წევრების სახელებს. -> დაბეჭდე პირველი და ბოლო ელემენტი (ინდექსებით)

family_names = ["alex" , "tata" , "daro" , "natia" , "soso" , "tamro" , "shalva"]
print (family_names [0])
print (family_names [6])

# 6) შექმენი სია, სადაც შეინახავ 6 სხვადასხვა რიცხვს. -> შეცვალე მეოთხე ინდექსზე მყოფი ელემენტი 100-ით

numbers_list = [12 , 22 , 33 , 15 , 16 , 41]
numbers_list [4] = 100

# 7) შექმენი სია, სადაც შეინახავ 10 ძაღლის სახელს. -> შეცვალე მეხუთე ელემენტი სხვა თამაშით

dog_names = ["marshall" , "luka" , "cupcake" , "robert" , "luna" , "bella" , "lucy" , "max" , "cooper" , "milo"]
dog_names [5] = "Lex"

# 8) შექმენი სია, სადაც შეინახავ 3 სტრინგს, 3 რიცხვს და 3 ბულეანს. -> დაბეჭდე ნებისმიერი ერთი ელემენტი ინდექსის გამოყენებით

types = ["string" , "string2" , "string3" , 1 , 2 , 3 , True , False , True]
print (types [2])

# 9) შექმენი სია, სადაც შეინახავ 5 მუსიკოსის სახელს. -> თუ პირველი ელემენტი არის 'Drake' -> შეცვალე სხვა მუსიკოსით

musicians = ["Drake" , "Taylor Swift" , "The Weeknd" , "MJ" , "scott ian"]
musicians [0] = "joe belladona"
print (musicians)

# 10) შექქმენი სია, სადაც შეინახავ რიცხვებს(როგორც მთელები ისე არამთელები) -> გაზარდე სიის პირველი და ბოლო ელემენტი 1000-ით

numbers2 = [12 , 13 , 15 , 28.4 , 34,5 , 21]
numbers2 [0] = numbers2 [0] + 1000
numbers2 [5] = numbers2 [5] + (1000)
print (numbers2)

# 11) შექმენი სია, სადაც შეინახავ 3 რიცხვს(როგორც მთელები ისე არამთელები)
#   - თუ პირველი რიცხვი არის მეტი 10-ზე:
#       გაზარდე სიის მესამე ელემენტი პირველი და მეორე ელემენტის ნამრავლით
#   - სხვა შემთხვევაში:
#       გაზარდე სიის პირველი ელემენტი მეორე და მესამე ელემენტის ნამრავლით

numbers = [12, 3, 4]
if numbers[0] > 10:
    numbers[2] = numbers[2] + (numbers[0] * numbers[1])
else:
    numbers[0] = numbers[0] + (numbers[1] * numbers[2])
print(numbers)