# 1) iteration - რაღაცის გამერიობის პროცესი ანუ Loop
# 2) algorithm - არის ინსტრუქცია რომელიც გამოიყენება ბევრი რამის გასაკეთევლად მაგალითად:
#კერძის გაკეთების რიცეპტი ,  ფეხსაცმლის შეკვრა და მაგალითად კბილების გახეხვა არის ალგორითმი
# 3) ალგორითმის აღწერის 4 ენა არსებობს pseudocode-ანუ კოდი ოღონდ გაადვილებული. ახასიათებს როგორი უნდა იყოს კოდი თეგების გამოყენების გარეშე მაგრამ მაინც დაახლოებულად იგივე ნაირად წერს ასე ვთქვათ კოდის გეგმა
#natural language - უბრალოდ ჩასასმელი კოდი ნებისმიერი ადამიანური ენით აღწერილი. ნებისმიერი ენა იმუშავებს გინდა ფრანგული გინდა ქართული განსხვავება საერთოდ არ არის
# flowchart - არის კოდის ვიზუალური აღწერა
# programming language - ეს არის პროგრამირების ენა და დამოკიდებულია რომელ ენაზე წერ
for i in range(25):
    print("for loop")
for i in range(50 , 76):
    print(i)
for i in range(40 , 91):
    print(i)
for i in range(25 , 151 , 4):
    print(i)
for i in range(100 , 1000 , 10):
    print(i)
for i in range(100):
    print("GOA მაგარია!")